

var cfg_error = {
    enter_game: {
        [1]: "对不起，当前游戏服务不存在，请稍后重试！",
        [2]: "对不起，当前房间已满，请稍后重试！",
        [3]: "对不起，当前桌台已满，请稍后重试！",
        [4]: "对不起，查询玩家信息失败，请稍后重试！",
        [5]: "对不起，您的金币不足，请充值后重试！",
        [6]: "对不起，当前游戏已经开始，请耐心等待下一局！",
        [7]: "对不起，您的金币不足，请充值后重试！",
        [8]: "对不起，您的金币过多，无法进入当前房间！",
        [9]: "对不起，您当前正在别的游戏中，无法进入当前房间！",
        [10]: "对不起，当前游戏服务器正在维护，请稍后重试！",
        [11]: "对不起，您长时间没有操作，已被请出当前房间！",
        [12]: "本局已结束，返回大厅继续游戏！",
        [13]: "对不起，断线重连，游戏已结束！",
    },
    brnn_bet: {
        [1]:'游戏未开始',
        [2]:'没有找到下注区域',
        [3]:'用户无效',
        [4]:'下注失败，下注总额不能超过携带总额的1/3',
        [5]:'下注已达区域上限',
        [6]:'机器人分不够下注',
        [7]:'机器人限红',
        [8]:'下注筹码不对',
    },
    brlh_bet: {
        [1]:'游戏未开始',
        [2]:'没有找到下注区域',
        [3]:'用户无效',
        [4]:'筹码不足',
        [5]:'下注已达区域上限',
        [6]:'机器人分不够下注',
        [7]:'机器人限红',
        [8]:'下注筹码不对',
    }


}


export default cfg_error ;


