
export class game{
    id : number;
}
var game_type :{ [key :string]: game} = {

    ["龙虎大战"]: {
        id: 900,

    },
    
    ["抢庄牛牛"]: {
        id: 830,

    },
    
    ["红黑大战"]: {
        id: 210,

    },
    
    ["看牌抢庄金花"]: {
        id: 820,

    },
    
    ["百人牛牛"]: {
        id: 930,

    },
    
    ["抢庄金花"]: {
        id: 840,

    },
    
    ["百人二八杠"]: {
        id: 720,

    },
    
    ["通比金花"]: {
        id: 850,

    },
    
    ["通比牛牛"]: {
        id: 870,

    },
    
    ["看牌抢庄牛牛"]: {
        id: 890,

    },
    
    ["选牌牛牛"]: {
        id: 810,

    },
    
    ["选牌金花"]: {
        id: 880,

    },
    
    ["三公"]: {
        id: 860,

    },
    
    ["百人金花"]: {
        id: 920,

    },
    
    ["斗地主"]: {
        id: 100,

    },
    
    ["炸金花"]: {
        id: 220,

    },
    
    ["奔驰宝马"]: {
        id: 950,

    },
    
    ["二十一点"]: {
        id: 600,

    },
    
    ["十三水"]: {
        id: 550,

    },

    ["跑得快"]: {
        id: 300,

    },

    ["梭哈"]: {
        id: 420,
    },

    ["德州扑克"]: {
        id: 450,
    },

    ["百家乐"]: {
        id: 910,
    },

    ["全部游戏"]: {
        id: 0,

    },

}
export default game_type;
