
export class account_type {
    type: string;
}
var numberTabel: { [key: number]: account_type } = {

    [1]: {
        type: "注册奖励",

    },

    [2]: {
        type: "绑定手机奖励",

    },

    [3]: {
        type: "充值",

    },

    [4]: {
        type: "兑换金币",

    },

    [5]: {
        type: "充值返还奖励",

    },

    [6]: {
        type: "充值补发金币",

    },

    [7]: {
        type: "支付补发",

    },

    [8]: {
        type: "系统赠送",

    },

    [9]: {
        type: "兑换驳回返回",

    },

    [10]: {
        type: "兑换取消返回",

    },

    [11]: {
        type: "存入保险箱",

    },

    [12]: {
        type: "从保险箱取出",

    },

    [19]: {
        type: "活动奖励",

    },

    [20]: {
        type: "救济金",

    },

    [21]: {
        type: "红包",

    },

    [22]: {
        type: "任务奖励",

    },

    [23]: {
        type: "邮件补助",

    },

    [24]: {
        type: "签到",

    },

    [25]: {
        type: "举报扣币",

    },

    [26]: {
        type: "举报奖励",

    },

    [30]: {
        type: "地推充值到支付代理",

    },

    [31]: {
        type: "代理回调给玩家充值",

    },

    [32]: {
        type: "提取代理佣金",

    },

    [33]: {
        type: "地推兑换到游戏金币",

    },

    [34]: {
        type: "地推兑换到支付宝",

    },

    [35]: {
        type: "俱乐部兑换到金币",

    },

    [80]: {
        type: "游戏输赢",

    },

    [0]: {
        type: "全部类型",

    },

    [100]: {
        type: "引流奖励彩金",

    },

    [101]: {
        type: "注册送88彩金",

    },

    [102]: {
        type: "登录投注奖励",

    },

    [103]: {
        type: "线下充值返利",

    },

    [104]: {
        type: "推广送彩金",

    },

    [105]: {
        type: "直属充值返利",

    },

    [106]: {
        type: "首充赠送",

    },

    [107]: {
        type: "跑量奖励",

    },

    [108]: {
        type: "累计充值奖励",

    },

    [110]: {
        type: "俱乐部抢庄牛牛当庄五花牛奖励588",

    },

    [111]: {
        type: "俱乐部抢庄牛牛当庄五小牛奖励388",

    },

    [112]: {
        type: "俱乐部三公专场当庄爆玖奖励888",

    },

    [113]: {
        type: "俱乐部三公专场当庄炸弹奖励666",

    },

    [114]: {
        type: "俱乐部炸金花连赢9把奖励588",

    },

    [115]: {
        type: "俱乐部炸金花连赢8把奖励488",

    },

    [116]: {
        type: "俱乐部炸金花连赢7把奖励388",

    },

    [117]: {
        type: "俱乐部炸金花豹子AAA特殊奖励588",

    },

    [118]: {
        type: "俱乐部炸金花豹子666特殊奖励488",

    },

    [119]: {
        type: "俱乐部炸金花豹子888特殊奖励388",

    },
    
    [120]: {
        type: "俱乐部跑得快十局内三飞机两次全关奖励88",

    },
    
    [121]: {
        type: "俱乐部跑得快十局内七连对两次全关奖励108",

    },
    
    [122]: {
        type: "俱乐部跑得快十局内两炸两次全关奖励128",

    },
    
    [123]: {
        type: "俱乐部跑得快十局内四次全关奖励188",

    },
    
    [124]: {
        type: "俱乐部跑得快十局内六次全关奖励388",

    },
    
    [125]: {
        type: "俱乐部跑得快十局内八次全关奖励888",

    },
    
    [126]: {
        type: "俱乐部跑得快十局内十次全关奖励1888",

    },
    
    [127]: {
        type: "俱乐部跑得快十局内三飞机两次全关奖励158",

    },
    
    [128]: {
        type: "俱乐部跑得快十局内七连对两次全关奖励188",

    },
    
    [129]: {
        type: "俱乐部跑得快十局内两炸两次全关奖励288",

    },
    
    [130]: {
        type: "俱乐部跑得快十局内四次全关奖励588",

    },

    [131]: {
        type: "俱乐部跑得快十局内六次全关奖励888",

    },

    [132]: {
        type: "俱乐部跑得快十局内八次全关奖励1888",

    },

    [133]: {
        type: "俱乐部跑得快十局内十次全关奖励3888",

    },

    [13]: {
        type: "金币换房卡",

    },

    [15]: {
        type: "转出房卡",

    },

    [14]: {
        type: "转入房卡",

    },

    [16]: {
        type: "消费房卡",

    },

    [17]: {
        type: "系统赠送房卡",

    },

}
export default numberTabel;
