
export class account_type {
    type: number;
}
var personal: { [key: string]: account_type } = {

    ["注册奖励"]: {
        type: 1,

    },

    ["绑定手机奖励"]: {
        type: 2,

    },

    ["充值"]: {
        type: 3,

    },

    ["兑换金币"]: {
        type: 4,

    },

    ["充值返还奖励"]: {
        type: 5,

    },

    ["充值补发金币"]: {
        type: 6,

    },

    ["支付补发"]: {
        type: 7,

    },

    ["系统赠送"]: {
        type: 8,

    },

    ["兑换驳回返回"]: {
        type: 9,

    },

    ["兑换取消返回"]: {
        type: 10,

    },

    ["存入保险箱"]: {
        type: 11,

    },

    ["从保险箱取出"]: {
        type: 12,

    },

    ["活动奖励"]: {
        type: 19,

    },

    ["救济金"]: {
        type: 20,

    },

    ["红包"]: {
        type: 21,

    },

    ["任务奖励"]: {
        type: 22,

    },

    ["邮件补助"]: {
        type: 23,

    },

    ["签到"]: {
        type: 24,

    },

    ["举报扣币"]: {
        type: 25,

    },

    ["举报奖励"]: {
        type: 26,

    },

    ["地推充值到支付代理"]: {
        type: 30,

    },

    ["代理回调给玩家充值"]: {
        type: 31,

    },

    ["提取代理佣金"]: {
        type: 32,

    },

    ["地推兑换到游戏金币"]: {
        type: 33,

    },

    ["地推兑换到支付宝"]: {
        type: 34,

    },

    ["俱乐部兑换到金币"]: {
        type: 35,

    },

    ["游戏输赢"]: {
        type: 80,

    },

    ["全部类型"]: {
        type: 0,

    },

    ["推广送彩金"]: {
        type: 104,

    },

    ["直属充值返利"]: {
        type: 105,

    },

    ["线下充值返利"]: {
        type: 103,

    },

    ["注册送88彩金"]: {
        type: 101,

    },

    ["登录投注奖励"]: {
        type: 102,

    },

    ["引流奖励彩金"]: {
        type: 100,

    },

    ["跑量奖励"]: {
        type: 107,

    },

    ["累计充值奖励"]: {
        type: 108,

    },
    ["金币换房卡"]: {
        type: 13,

    },

}
export default personal;
