
export class game{
    room_name : string;
}
var room_name :{ [key :number]: game} = {

    [9001]: {
        room_name: "龙虎大战（体验场）",

    },

    [9002]: {
        room_name: "龙虎大战（平民场）",

    },

    [9003]: {
        room_name: "龙虎大战（贵族场）",

    },

    [9004]: {
        room_name: "龙虎大战（官甲场）",

    },
    

    [8301]: {
        room_name: "抢庄牛牛（体验场）",

    },

    [8302]: {
        room_name: "抢庄牛牛（平民场）",

    },

    [8303]: {
        room_name: "抢庄牛牛（贵族场）",

    },

    [8304]: {
        room_name: "抢庄牛牛（官甲场）",

    },

    
    [2101]: {
        room_name: "红黑大战（体验场）",

    },

    [2102]: {
        room_name: "红黑大战（平民场）",

    },

    [2103]: {
        room_name: "红黑大战（贵族场）",

    },

    [2104]: {
        room_name: "红黑大战（官甲场）",

    },

    [8201]: {
        room_name: "看牌抢庄金花（体验场）",

    },

    [8202]: {
        room_name: "看牌抢庄金花（平民场）",

    },

    [8203]: {
        room_name: "看牌抢庄金花（贵族场）",

    },

    [8204]: {
        room_name: "看牌抢庄金花（官甲场）",

    },
    

    [9301]: {
        room_name: "百人牛牛（体验场）",

    },

    [9302]: {
        room_name: "百人牛牛（平民场）",

    },

    [9303]: {
        room_name: "百人牛牛（贵族场）",

    },

    [9304]: {
        room_name: "百人牛牛（官甲场）",

    },

    [8401]: {
        room_name: "抢庄金花（体验场）",

    },

    [8402]: {
        room_name: "抢庄金花（平民场）",

    },

    [8403]: {
        room_name: "抢庄金花（贵族场）",

    },

    [8404]: {
        room_name: "抢庄金花（官甲场）",

    },
    

    [7201]: {
        room_name: "百人二八杠（体验场）",

    },

    [7202]: {
        room_name: "百人二八杠（平民场）",

    },

    [7203]: {
        room_name: "百人二八杠（贵族场）",

    },

    [7204]: {
        room_name: "百人二八杠（官甲场）",

    },
    
    [8501]: {
        room_name: "通比金花（体验场）",

    },

    [8502]: {
        room_name: "通比金花（平民场）",

    },

    [8503]: {
        room_name: "通比金花（贵族场）",

    },

    [8504]: {
        room_name: "通比金花（官甲场）",

    },

    [8701]: {
        room_name: "通比牛牛（体验场）",

    },

    [8702]: {
        room_name: "通比牛牛（平民场）",

    },

    [8703]: {
        room_name: "通比牛牛（贵族场）",

    },

    [8704]: {
        room_name: "通比牛牛（官甲场）",

    },

    [8901]: {
        room_name: "看牌抢庄牛牛（体验场）",

    },

    [8902]: {
        room_name: "看牌抢庄牛牛（平民场）",

    },

    [8903]: {
        room_name: "看牌抢庄牛牛（贵族场）",

    },

    [8904]: {
        room_name: "看牌抢庄牛牛（官甲场）",

    },


    [8101]: {
        room_name: "选牌牛牛（体验场）",

    },

    [8102]: {
        room_name: "选牌牛牛（平民场）",

    },

    [8103]: {
        room_name: "选牌牛牛（贵族场）",

    },

    [8104]: {
        room_name: "选牌牛牛（官甲场）",

    },
    
    [8801]: {
        room_name: "选牌金花（体验场）",

    },

    [8802]: {
        room_name: "选牌金花（平民场）",

    },

    [8803]: {
        room_name: "选牌金花（贵族场）",

    },

    [8804]: {
        room_name: "选牌金花（官甲场）",

    },

    [8601]: {
        room_name: "三公（体验场）",

    },

    [8602]: {
        room_name: "三公（平民场）",

    },

    [8603]: {
        room_name: "三公（贵族场）",

    },

    [8604]: {
        room_name: "三公（官甲场）",

    },
    

    [9201]: {
        room_name: "百人金花（体验场）",

    },

    [9202]: {
        room_name: "百人金花（平民场）",

    },

    [9203]: {
        room_name: "百人金花（贵族场）",

    },

    [9204]: {
        room_name: "百人金花（官甲场）",

    },

    
    [1001]: {
        room_name: "斗地主（体验场）",

    },

    [1002]: {
        room_name: "斗地主（平民场）",

    },

    [1003]: {
        room_name: "斗地主（贵族场）",

    },

    [1004]: {
        room_name: "斗地主（官甲场）",

    },

    [3001]: {
        room_name: "跑得快（体验场）",

    },

    [3002]: {
        room_name: "跑得快（平民场）",

    },

    [3003]: {
        room_name: "跑得快（贵族场）",

    },

    [3004]: {
        room_name: "跑得快（官甲场）",

    },

    [2201]: {
        room_name: "炸金花（体验场）",

    },

    [2202]: {
        room_name: "炸金花（平民场）",

    },

    [2203]: {
        room_name: "炸金花（贵族场）",

    },

    [2204]: {
        room_name: "炸金花（官甲场）",

    },

    [9501]: {
        room_name: "奔驰宝马（体验场）",

    },

    [6001]: {
        room_name: "二十一点（体验场）",

    },

    [6002]: {
        room_name: "二十一点（平民场）",

    },

    [6003]: {
        room_name: "二十一点（贵族场）",

    },

    [6004]: {
        room_name: "二十一点（官甲场）",

    },

    
    [5501]: {
        room_name: "十三水（体验场）",

    },

    [5502]: {
        room_name: "十三水（平民场）",

    },

    [5503]: {
        room_name: "十三水（贵族场）",

    },

    [5504]: {
        room_name: "十三水（官甲场）",

    },

    [4201]: {
        room_name: "梭哈（体验场）",

    },

    [4202]: {
        room_name: "梭哈（平民场）",

    },

    [4203]: {
        room_name: "梭哈（贵族场）",

    },

    [4204]: {
        room_name: "梭哈（官甲场）",

    },

    [4501]: {
        room_name: "德州扑克（体验场）",

    },

    [4502]: {
        room_name: "德州扑克（平民场）",

    },

    [4503]: {
        room_name: "德州扑克（贵族场）",

    },

    [4504]: {
        room_name: "德州扑克（官甲场）",

    },
    [9101]: {
        room_name: "百家乐（体验场）",
    },
    [9102]: {
        room_name: "百家乐（平民场）",
    },
    [9103]: {
        room_name: "百家乐（贵族场）",
    },
    [9104]: {
        room_name: "百家乐（官甲场）",
    }

}
export default room_name;
